package main

import (
	"golang.org/x/text/language"
)

func Language_zhHant() {
	RegisterTranslations(language.TraditionalChinese, map[string]string{
		"介绍1":       "予瞬息以永恆，於長夜留餘溫。",
		"介绍2":       "是一款透過提取照片原始拍攝時間，為您自動重新命名的工具。",
		"使用方式":      "使用方式: %s [相片檔案1] [相片檔案2] ...\n如果直接執行而不提供相片檔案，則會進入設定模式。",
		"軟件配置":      "軟體設定",
		"配置文件名命名格式": "設定檔檔名命名格式",
		"当前格式":      "目前重新命名的格式為",
		"要配置格式":     "要設定重新命名的格式，請不帶參數直接執行",
		"可用变量":      "可用變數:\n  YYYY/YY: 年, MM/M: 月, DD/D: 日\n  HH/H: 時, mm/m: 分, ss/s: 秒\n  ##: 編號(前面補0), #: 編號(不補0)\n  *: 原始檔名\n  字母數量代表位數，例如 2025 的 YY 為 25, 1月的 M 為 1, MM 為 01",
		"默认格式例":     "  例如，預設格式 `%s` 將會輸出 `%s`。\n請輸入新的檔名命名格式並按 Enter，如果留空則保留目前設定。\n> ",
		"示例输出":      "範例輸出",
		"格式已设定":     "格式已設定為",
		"询问预览":      "是否在重新命名前預覽確認？",
		"当前设置":      "目前設定",
		"询问预览说明":    "如果開啟，會先向您展示修改後的樣子，讓您確認是否要繼續。\n請輸入 `y` 或 `n`。預設值 `y`: 每次先詢問我, `n`: 直接開始重新命名。\n> ",
		"预览确认开":     "已開啟預覽確認。",
		"预览确认关":     "已關閉預覽確認。請小心操作。",
		"结束等待":      "在執行結束後，需要提示「按 Enter 鍵退出」以便停留查看結果嗎？",
		"结束等待说明":    "請輸入 `y` 或 `n`。預設值 `y`: 結束後等待使用者按 Enter 鍵, `n`: 結束後直接退出。\n> ",
		"结束等待关":     "結束後直接退出",
		"结束等待开":     "結束後等待使用者按 Enter 鍵",
		"保存配置失败":    "儲存設定到 %s 失敗: %v",
		"保存配置成功":    "設定已成功儲存到 ",
		"回车退出":      "按 Enter 鍵退出",
		"修改日期":      "檔案修改日期",
		"正在分析":      "正在分析要重新命名的檔案",
		"错误":        "[錯誤]",
		"跳过":        "[跳過]",
		"路径错误":      "無法解析路徑",
		"文件错误":      "無法讀取相片資訊",
		"原文件":       "原檔案",
		"依据":        "時間來源",
		"新文件名":      "新檔名",
		"没有文件":      "未發現可處理的相片檔案。",
		"共计":        "共計 %d 個檔案，",
		"确认":        "確認執行重新命名",
		"开始":        "開始正式進行檔案重新命名",
		"无变化":       "檔名未發生變化",
		"重命名失败":     "重新命名失敗！",
		"重命名成功":     "重新命名成功。",
		"已存在":       "目標檔案已存在。",
		"处理结果":      "\n處理完成！成功: %d, 失敗: %d, 總計: %d",
		"取消":        "已取消操作。",
	})
}
